
## Plan Result




<pre><code>Plan: 1 to add, 11 to change, 0 to destroy.</code></pre>

* Create
  * module.send-letter-key-vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;rpe-shared&#34;]
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.db-v11.azurerm_resource_group.data-resourcegroup
  * module.db-v11.azurerm_template_deployment.postgres-paas
  * module.send-letter-key-vault.azurerm_key_vault.kv
  * module.send-letter-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.send-letter-key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.staging-db[0].azurerm_resource_group.data-resourcegroup
  * module.staging-db[0].azurerm_template_deployment.postgres-paas
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.Insights/components/rpe-send-letter-service-appinsights-aat"
        name                                  = "rpe-send-letter-service-appinsights-aat"
      ~ tags                                  = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat"
        name     = "rpe-send-letter-service-aat"
      ~ tags     = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (1 unchanged attribute hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.Resources/deployments/BSP_Alert"
        name                = "BSP_Alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.db-v11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "send-letter-service-db-aat"
      + resource_group_name = "send-letter-service-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.db-v11.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/send-letter-service-db-data-aat"
        name     = "send-letter-service-db-data-aat"
      ~ tags     = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (1 unchanged attribute hidden)
    }

  # module.db-v11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/send-letter-service-db-data-aat/providers/Microsoft.Resources/deployments/send-letter-service-db-aat"
        name                = "send-letter-service-db-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc2VuZC1sZXR0ZXItc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3BsYXRvcHMtaGVscCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IlNvZnR3YXJlIEVuZ2luZWVyaW5nIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL3NlbmQtbGV0dGVyLXNlcnZpY2UuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat"
        name                            = "rpe-send-letter-aat"
      ~ tags                            = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.send-letter-key-vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["rpe-shared"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat"
      + object_id          = "9ca7dc72-5283-4c87-87bd-d382691f047a"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.send-letter-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat|rpe-send-letter-aat"
        name                       = "rpe-send-letter-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.send-letter-key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/rpe-aat-mi"
        name                = "rpe-aat-mi"
      ~ tags                = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (5 unchanged attributes hidden)
    }

  # module.staging-db[0].data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "send-letter-service-stg-db-aat"
      + resource_group_name = "send-letter-service-stg-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.staging-db[0].azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/send-letter-service-stg-db-data-aat"
        name     = "send-letter-service-stg-db-data-aat"
      ~ tags     = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (1 unchanged attribute hidden)
    }

  # module.staging-db[0].azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/send-letter-service-stg-db-data-aat/providers/Microsoft.Resources/deployments/send-letter-service-stg-db-aat"
        name                = "send-letter-service-stg-db-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc2VuZC1sZXR0ZXItc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3BsYXRvcHMtaGVscCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IlNvZnR3YXJlIEVuZ2luZWVyaW5nIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL3NlbmQtbGV0dGVyLXNlcnZpY2UuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.Storage/storageAccounts/rpesendletteraat"
        name                              = "rpesendletteraat"
      ~ tags                              = {
            "application"         = "core"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 11 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2416,"Program":"tfcmt","SHA1":"","Vars":{}} -->